____

<center> <h1 style="background-color:#975be5; color:white"><br>01-Categorical_Vars_Exercise - Solutions<br></h1></center>

____

<div align="right">
    <b><a href="https://keytodatascience.com/">KeytoDataScience.com   </a></b>
</div>

In [1]:
import pandas as pd

In [2]:
# Define the headers since the data does not have any
headers = ["symboling", "normalized_losses", "make", "fuel_type", "aspiration",
           "num_doors", "body_style", "drive_wheels", "engine_location",
           "wheel_base", "length", "width", "height", "curb_weight",
           "engine_type", "num_cylinders", "engine_size", "fuel_system",
           "bore", "stroke", "compression_ratio", "horsepower", "peak_rpm",
           "city_mpg", "highway_mpg", "price"]

# Read in the CSV file and convert "?" to NaN
df = pd.read_csv("Automobile price data _Raw_.txt", header=None, names=headers, na_values="?" )
df = df.loc[1:,]
df = df[["make", "fuel_type", "num_doors", "body_style", "city_mpg", "price"]]
df.head()

          make fuel_type num_doors   body_style city_mpg  price
1  alfa-romero       gas       two  convertible       21  13495
2  alfa-romero       gas       two  convertible       21  16500
3  alfa-romero       gas       two    hatchback       19  16500
4         audi       gas      four        sedan       24  13950
5         audi       gas      four        sedan       18  17450

In [3]:
# check nulls for the column num_doors

2

In [4]:
# check distribution of var num_doors

four    114
two      89
Name: num_doors, dtype: int64

Before going any further, there are a couple of null values in the data that we need to clean up.

In [5]:
# impute num_doors by its mode

In [6]:
# Label encode the feature 'num_doors'

          make fuel_type num_doors   body_style city_mpg  price  num_doors_le
1  alfa-romero       gas       two  convertible       21  13495             1
2  alfa-romero       gas       two  convertible       21  16500             1
3  alfa-romero       gas       two    hatchback       19  16500             1
4         audi       gas      four        sedan       24  13950             0
5         audi       gas      four        sedan       18  17450             0

In [7]:
# Perform One hot encode on 'num_doors' and merge it with rest of dataset

,make,fuel_type,body_style,city_mpg,price,num_doors_le,num_doors_four,num_doors_two
1,alfa-romero,gas,convertible,21,13495,1,0,1
2,alfa-romero,gas,convertible,21,16500,1,0,1
3,alfa-romero,gas,hatchback,19,16500,1,0,1
4,audi,gas,sedan,24,13950,0,1,0
5,audi,gas,sedan,18,17450,0,1,0

____

<center> <h1 style="background-color:#975be5; color:white"><br>Great Job!<br></h1><br></center>

____

<div align="right">
    <b><a href="https://keytodatascience.com/">KeytoDataScience.com</a></b>
</div>